In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 ={
    "name":["harry","rohan","shubh"],
    "marks":[98,76,88],
    "city":["Siliguri","kolkata","chennai"]
}

In [3]:
df= pd.DataFrame(dict1)

In [4]:
df

    name  marks      city
0  harry     98  Siliguri
1  rohan     76   kolkata
2  shubh     88   chennai

In [5]:
n = pd.read_csv("carsample.csv")

In [6]:
n

         CAR    PRICE        BRAND
0  aventedor  1.2 mil  lamborghini
1      ghost    5 mil  rolls-royce
2      supra     900k       toyota

In [7]:
n["PRICE"]

0    1.2 mil
1      5 mil
2       900k
Name: PRICE, dtype: object

In [8]:
n["PRICE"][0]="1.5 mil"

In [9]:
n.index = ['first',"second","third"]

In [10]:
n

              CAR    PRICE        BRAND
first   aventedor  1.5 mil  lamborghini
second      ghost    5 mil  rolls-royce
third       supra     900k       toyota

In [11]:
print(n.dtypes)

CAR      object
PRICE    object
BRAND    object
dtype: object

In [12]:
n.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, first to third
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CAR     3 non-null      object
 1   PRICE   3 non-null      object
 2   BRAND   3 non-null      object
dtypes: object(3)
memory usage: 96.0+ bytes